package model;

//public - класс будет виден для этого пакета и для всех остальных покетов проекта
/// отсутствует public - класс доступа только внутри текущего пакета
///класс -  шаблон по которому можно создовать объеты  котырые будут хронится в объекте
// модификатора доступа
// элемент помеченый public- видет во всех покетах ... можно применять в классах , полях , методах
//-- модификатры///
// в JS  - элемент не помеченый никаким модификатором доступа считаются  - ПЕКЕТОМ package private-
///можно обратится только внутри этого пакета
///protected- доступет в текущем пакете и во всех классах наследниках
// private - доступет только внутри класса(полям и методам)



public class
Person {
    // поле свойство хороктеристики
   public String name;
   public int age;
}

